In [34]:
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3

conn = sqlite3.connect('infldatabase.db')
cursor = conn.cursor()

# Inflation Rates for 2022

### Which country had the highest inflation rate in 2022?

In [35]:
conn = sqlite3.connect('infldatabase.db')
cursor = conn.cursor()

highest_rate = '''SELECT CountryName, AnnualInflation
FROM InflationRates
WHERE AnnualInflation = (SELECT MAX(AnnualInflation) FROM InflationRates)
'''

df_high_inflation = pd.read_sql_query(highest_rate,conn)
df_high_inflation

  CountryName  AnnualInflation
0     Lebanon       171.205491

What was the global average annual inflation rate in 2022?

In [36]:
conn = sqlite3.connect('infldatabase.db')
cursor = conn.cursor()
print('The average global inflation in 2022 was:')

average_rate ='''SELECT AVG(AnnualInflation) AS Annual_Inflation
FROM InflationRates'''

df_average_inflation = pd.read_sql_query(average_rate, conn)
df_average_inflation

The average global inflation in 2022 was:

   Annual_Inflation
0         11.493083

Which countries experienced an average inflation rate over 30%?

In [37]:

Inflation_over_5 = '''
SELECT CountryName, CountryCode, AnnualInflation
FROM InflationRates
WHERE AnnualInflation > 30
ORDER BY AnnualInflation DESC
'''
#fetches the result
df_high_inflation = pd.read_sql_query(Inflation_over_5, conn)
#displays the result
df_high_inflation

          CountryName CountryCode  AnnualInflation
0             Lebanon         LBN       171.205491
1               Sudan         SDN       138.808460
2            Zimbabwe         ZWE       104.705171
3             Turkiye         TUR        72.308836
4            Suriname         SUR        52.446027
5           Sri Lanka         LKA        49.721102
6  Iran, Islamic Rep.         IRN        43.488464
7               Haiti         HTI        33.983932
8            Ethiopia         ETH        33.889880
9               Ghana         GHA        31.255895